app/controllers/articles_controller.rb

	def create
		#Article refers to class in models
		@article = Article.new(article_params)

		if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "fadfa"], ["text", "ffffff"], ["created_at", "2015-11-11 01:27:46.185011"], ["updated_at", "2015-11-11 01:27:46.185011"]]